package java06_class;

//일반 클래스
//기능 클래스
//	메인 메소드가 없는 클래스
//	스스로 프로그램을 시작할 수 없는 클래스

public class Class_01 { // 추상화 -> 현실 객체
//	클래스 -----------> 인스턴스
//	        인스턴스화 해야 사용 가능
//				new= 수행코드
//				수행 코드 <- 메소드 안에서 작동
	
	
//	멤버, Member
//	추상화 대상에 대해 3가지로 나뉨 +생성자 
	
//	멤버 필드, Member Field
//	-> 주로 변수의 모양을 가짐
//	-> 객체의 데이터 정보, 속성들을 추상화한 것
//	-> 변수 또는 상수
	int num;
	String data; //중괄호 확인. 지역 변수와 구분
	
	
	
//	멤버 메소드, Member Method
//	->객체의 기능, 행위, 동작
	public void display() { //메소드명은 식별자로 작성
//		수행 코드 작성 가능
//		수행 코드는 메소드를 정의 하는 안에 작성 해야함	
		System.out.println("HIHI"); //수행 코드
		
		
		
		
	}
	
	
//	에러, 클래스 정의코드에 포함되었기 때문
//	System.out.println(); 
	
	
	
//	+생성자
	
	
	
	
	
	
	
	
	
	
	
	
	

}//class
